{"ID":18358,"Author":{"Name":"prashere","ID":0,"FullName":"","Gravatar":"6a77946c4ab2b5fd7c7869816e1b8278"},"Title":"Git - Working on Existing or Cloned Project","Description":"\u003cdiv class=\"content\"\u003e\u003cp\u003eSo you have cloned a git based project to work on. This cast will just guide you through how to edit some files on that project, add your contributions, commit and then push it to the main repository.\u003c/p\u003e\n\n\u003col\u003e\n\u003cli\u003eNavigate to the project directory using cd command.\u003c/li\u003e\n\u003cli\u003eYou are making some changes to a file and saving it.\u003c/li\u003e\n\u003cli\u003eYou have tell git that, you have made some changes, so you have to add and then commit you changes with git. You can use git status command to check now and then.\u003c/li\u003e\n\u003cli\u003eBy the time you are editing this file, there is a very high chance that someone is also editing the same file and have pushed new changes to the main repository.\u003c/li\u003e\n\u003cli\u003eIf you try to push, it will say, git cannot push the changes since there are new changes on the repository, which you have pull first.\u003c/li\u003e\n\u003cli\u003eSo it is always a best practice to pull the changes first before pushing your changes.\u003c/li\u003e\n\u003cli\u003eYou can use git pull and the branch name to pull the changes.\u003c/li\u003e\n\u003cli\u003eIf there are any new updates, it will be synced with your local project along with your changes.\u003c/li\u003e\n\u003cli\u003eWhile pulling there is also a chance that you and someone else edited the same line in the same file. In that case it is called \u0026#39;conflict\u0026#39;. That is git is now confused. It doesn\u0026#39;t know which change it should keep / delete. So it will ask you to resolve the conflict manually. In this cast, you won\u0026#39;t find any conflict and so we are not dealing with it right now.\u003c/li\u003e\n\u003cli\u003eFinal step is to push your changes to the main repository.\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003e-\u0026gt; You edit a file\u003cbr/\u003e\n-\u0026gt; git status\u003cbr/\u003e\n-\u0026gt; git add -u\u003cbr/\u003e\n-\u0026gt; git commit -m \u0026#34;Some meaningful description about the changes you made\u0026#34;\u003cbr/\u003e\n-\u0026gt; git status\u003cbr/\u003e\n-.\u0026gt; git pull --rebase origin -branchname-\u003cbr/\u003e\n-\u0026gt; git push origin -branchname-\u003c/p\u003e\n\u003c/div\u003e","Time":"2015-04-03T17:43:15Z","Tags":["Linux","bash","xterm-256color"]}